sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
/*inline*/ void ForwardPacket(USBPacket *pPacket)
{
#if IS_HMD
	ForwardUSBPacket(pPacket);
#endif //IS_HMD				
#if IS_CONTROLLER				
	ForwardRFPacket(pPacket);
#endif //IS_CONTROLLER				
}

/*inline*/ void ProcessSensors()
{
	float elapsedTime = (now - lastRotationUpdate) / 1000000.0f; // set integration time by time elapsed since last filter update				

	if (elapsedTime >= 0.005f) //update at 200hz
	{
		hasRotationData |= readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values			
		hasRotationData |= readGyroData(tSensorData.Gyro.Raw);
		hasRotationData |= readMagData(tSensorData.Mag.Raw);


		if (hasRotationData) // recalc position if still has position data to be sent
		{
			ReadyMask |= READY_ROT;
			tSensorData.Accel.ProcessNew();
			tSensorData.Gyro.ProcessNew();
			tSensorData.Mag.ProcessNew();

			tSensorData.TimeElapsed = elapsedTime;
			lastRotationUpdate = now;
			orientQuat = orientFuse.FuseOrient(&tSensorData);

			//gravQuat = orientQuat;
//				gravQuat.w = 0; gravQuat.x = 0; gravQuat.y = 0; gravQuat.z = 0;
//				gravQuat = (orientQuat * gravQuat) * orientQuat.conjugate();

			if (isPositionReady && (hasPositionData || (isCalibrated && (ticks >= 10000))))
			{
				//float elapsedPositionTime = (float)(now - lastPositionIntegrateTime) / 1000000.0f;
				//if (elapsedPositionTime >= 0.001f) // integrate every 2 ms
				{
					GravityVector[0] = 2.0f * (orientQuat.x * orientQuat.z - orientQuat.w * orientQuat.y);
					GravityVector[1] = 2.0f * (orientQuat.w * orientQuat.x + orientQuat.y * orientQuat.z);
					GravityVector[2] = orientQuat.w * orientQuat.w - orientQuat.x * orientQuat.x - orientQuat.y * orientQuat.y + orientQuat.z * orientQuat.z;

					for (int i = 0; i < 3; i++)
					{
						float prevAccel = CompAccelVector[i];
						float prevVelocity = VelocityVector[i];
						float newAccel = tSensorData.Accel.Converted[i] - GravityVector[i];
						float newVelocity = ((prevAccel + newAccel) / 2.0f) * 9.81f * elapsedTime;
						float prevPosition = position.Position[i];

						//if velocity changes direction hold for a moment
//							if (sgn(prevVelocity) != sgn(newVelocity))
//							{
//								newVelocity = prevVelocity = 0;
//								//newAccel = 0;
//							}


						position.Position[i] = prevPosition + ((prevVelocity + newVelocity) / 2.0f) * elapsedTime * 10.0f;
						CompAccelVector[i] = newAccel;
						VelocityVector[i] = prevVelocity + newVelocity;
					}

					//if (now - lastPositionSend >= 20000) //50 ms
					{
						positionQuat.w = 0;
						positionQuat.x = position.Position[0];
						positionQuat.y = position.Position[1];
						positionQuat.z = position.Position[2];

						positionQuat = (orientQuat * positionQuat) * orientQuat.conjugate();

						hasPositionData = true;
						ReadyMask |= READY_POS;
						//lastPositionSend = now;	
					}

					//lastPositionIntegrateTime = now;
				}
			}
			//else
			//	lastPositionIntegrateTime = now;
		}
	}
}

#if IS_CONTROLLER
/*inline*/ void ProcessADC()
{
	if (ticks - LastADCChange >= 50) //20 analog values per second
	{
		uint8_t changed = 0;
		LastADCChange = ticks;
		ADC_Value[0] = (((float)(ADC_Values[0] + ADC_Values[2]) / 2.0f) * 0.5f) + (ADC_Value[0] * 0.5f);
		ADC_Value[1] = (((float)(ADC_Values[1] + ADC_Values[3]) / 2.0f) * 0.5f) + (ADC_Value[1] * 0.5f);

		uint32_t value0 = ((uint32_t)(ADC_Value[0] / 40.96f));
		uint32_t value1 = ((uint32_t)(ADC_Value[1] / 40.96f));

		if (ADC_Cache[0] != value0) { changed = 1; ADC_Cache[0] = value0; }
		if (ADC_Cache[1] != value1) { changed = 1; ADC_Cache[1] = value1; }
		if (changed)
		{
			//if any analog value has changes
			buttonRetransmit = 5;
			lastButtonRefresh = ticks;
		}
	}
}
#endif //IS_CONTROLLER

/*inline*/ void CalibrateSensors(void)
{
	for (int i = 0; i < 3; i++)
	{
		if (eepromData.Accel.Sensor == SENSOR_ACCEL)
		{
			tSensorData.Accel.Offset[i] = (float)(eepromData.Accel.RawMax[i] + eepromData.Accel.RawMin[i]) / 2.0f;
			//tSensorData.Accel.PosScale[i] = eepromData.Accel.RawMax[i] == 0? 1.0f : (1.0f / aRes) / (float)(eepromData.Accel.RawMax[i] - tSensorData.Accel.Offset[i]);
			//tSensorData.Accel.NegScale[i] = eepromData.Accel.RawMin[i] == 0? 1.0f : (1.0f / aRes) / (float)(eepromData.Accel.RawMin[i] - tSensorData.Accel.Offset[i]);
		}
		if (eepromData.Gyro.Sensor == SENSOR_GYRO)
		{
			tSensorData.Gyro.Offset[i] = (float)(eepromData.Gyro.RawMax[i]);
			tSensorData.Gyro.PosScale[i] = 1.0f;
			tSensorData.Gyro.NegScale[i] = 1.0f;
		}
		if (eepromData.Mag.Sensor == SENSOR_MAG)
		{
			tSensorData.Mag.Offset[i] = (float)(eepromData.Mag.RawMax[i] + eepromData.Mag.RawMin[i]) / 2.0f;
			//tSensorData.Mag.PosScale[i] = eepromData.Mag.RawMax[i] == 0? 1.0f : (1.0f / mRes) / (float)(eepromData.Mag.RawMax[i] - tSensorData.Mag.Offset[i]);
			//tSensorData.Mag.NegScale[i] = eepromData.Mag.RawMin[i] == 0? 1.0f : (1.0f / mRes) / (float)(eepromData.Mag.RawMin[i] - tSensorData.Mag.Offset[i]);
		}
	}
	isCalibrated = true;
}

/*inline*/ void ResetSensorCalibration()
{
	memset(&eepromData, 0, sizeof(eepromData));
	tSensorData.ResetCalibration();
	isCalibrated = false;
}



/* USER CODE END 0 */

int main(void)
{

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_DMA_Init();
  MX_I2C2_Init();
  MX_SPI2_Init();

  /* USER CODE BEGIN 2 */

#if IS_HMD		

  /* USB CUSTOM_HID device Configuration Descriptor */
	__ALIGN_BEGIN static uint8_t myDesc[USB_CUSTOM_HID_CONFIG_DESC_SIZ] __ALIGN_END =
	{
		0x09, /* bLength: Configuration Descriptor size */
		USB_DESC_TYPE_CONFIGURATION, /* bDescriptorType: Configuration */
		USB_CUSTOM_HID_CONFIG_DESC_SIZ,
		/* wTotalLength: Bytes returned */
		0x00,
		0x01,         /*bNumInterfaces: 1 interface*/
		0x01,         /*bConfigurationValue: Configuration value*/
		0x00,         /*iConfiguration: Index of string descriptor describing
			the configuration*/
		0xC0,         /*bmAttributes: bus powered */
		0x32,         /*MaxPower 100 mA: this current is used for detecting Vbus*/

		/************** Descriptor of CUSTOM HID interface ****************/
		/* 09 */
		0x09,         /*bLength: Interface Descriptor size*/
		USB_DESC_TYPE_INTERFACE,/*bDescriptorType: Interface descriptor type*/
		0x00,         /*bInterfaceNumber: Number of Interface*/
		0x00,         /*bAlternateSetting: Alternate setting*/
		0x02,         /*bNumEndpoints*/
		0x03,         /*bInterfaceClass: CUSTOM_HID*/
		0x00,         /*bInterfaceSubClass : 1=BOOT, 0=no boot*/
		0x00,         /*nInterfaceProtocol : 0=none, 1=keyboard, 2=mouse*/
		0,            /*iInterface: Index of string descriptor*/
		/******************** Descriptor of CUSTOM_HID *************************/
		/* 18 */
		0x09,         /*bLength: CUSTOM_HID Descriptor size*/
		CUSTOM_HID_DESCRIPTOR_TYPE, /*bDescriptorType: CUSTOM_HID*/
		0x11,         /*bCUSTOM_HIDUSTOM_HID: CUSTOM_HID Class Spec release number*/
		0x01,
		0x00,         /*bCountryCode: Hardware target country*/
		0x01,         /*bNumDescriptors: Number of CUSTOM_HID class descriptors to follow*/
		0x22,         /*bDescriptorType*/
		USBD_CUSTOM_HID_REPORT_DESC_SIZE,/*wItemLength: Total length of Report descriptor*/
		0x00,
		/******************** Descriptor of Custom HID endpoints ********************/
		/* 27 */
		0x07,          /*bLength: Endpoint Descriptor size*/
		USB_DESC_TYPE_ENDPOINT, /*bDescriptorType:*/

		CUSTOM_HID_EPIN_ADDR,     /*bEndpointAddress: Endpoint Address (IN)*/
		0x03,          /*bmAttributes: Interrupt endpoint*/
		CUSTOM_HID_EPIN_SIZE, /*wMaxPacketSize: 2 Byte max */
		0x00,
		0x01,          /*bInterval: Polling Interval (20 ms)*/
		/* 34 */

