sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
		0x07,	         /* bLength: Endpoint Descriptor size */
		USB_DESC_TYPE_ENDPOINT,	/* bDescriptorType: */
		CUSTOM_HID_EPOUT_ADDR,  /*bEndpointAddress: Endpoint Address (OUT)*/
		0x03,	/* bmAttributes: Interrupt endpoint */
		CUSTOM_HID_EPOUT_SIZE,	/* wMaxPacketSize: 2 Bytes max  */
		0x00,
		0x01,	/* bInterval: Polling Interval (20 ms) */
		/* 41 */
	};

	uint16_t usbDescLen = 0;
	uint8_t *usbDesc = USBD_CUSTOM_HID.GetFSConfigDescriptor(&usbDescLen);
	memcpy(usbDesc, myDesc, usbDescLen);
	//*usbDesc = *myDesc;
	MX_USB_DEVICE_Init();
#endif //IS_HMD

#if IS_CONTROLLER
	MX_ADC1_Init();
#endif //IS_CONTROLLER


	

	DigitalValues = DigitalCache = 0;
	LedOff();


	srand(THIS_DEVICE + HAL_GetTick());

	//load eeprom calibration data	
	char *eepromBytes = (char *)&eepromData;
	int addr = 0;
	for (int i = 0; i < sizeof(eepromData); i += sizeof(uint32_t))
	{
		*((uint32_t *)(&eepromBytes[i])) = readEEPROMWord(addr);
		addr += sizeof(uint32_t);
	}

	if (eepromData.Magic == VALID_EEPROM_MAGIC)
		CalibrateSensors();
	else
		ResetSensorCalibration();



#if IS_CONTROLLER
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET);
	BlinkRease(30);
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
	HAL_Delay(250);
#endif //IS_CONTROLLER

	rfStatus = NRF24L01_Init();
	if (rfStatus == 0x00 || rfStatus == 0xff)
		Error_Handler();
	LedOff();


	sensorStatus = initSensors();
	if (!sensorStatus)
		Error_Handler();
	LedOff();

#if IS_CONTROLLER
	buttonRefreshTimeout = 250;
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_SET);
	BlinkRease(20);
	HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
	HAL_Delay(100);

	//start background adc conversion
	if (HAL_ADC_Start(&hadc1) != HAL_OK)
		Error_Handler();
	if (HAL_ADC_Start_DMA(&hadc1, (uint32_t*)ADC_Values, 4) != HAL_OK)
		Error_Handler();
	HAL_Delay(100);
#endif //IS_CONTROLLER		

	tSensorData.Setup(aRes, gRes, mRes);


	//do some warmup
	for (int i = 0; i < 100; i++)
	{
		readAccelData(tSensorData.Accel.Raw);  // Read the x/y/z adc values		
		tSensorData.Accel.ProcessNew();
		HAL_Delay(1);
		readGyroData(tSensorData.Gyro.Raw);
		tSensorData.Gyro.ProcessNew();
		HAL_Delay(1);
		readMagData(tSensorData.Mag.Raw);
		tSensorData.Mag.ProcessNew();
		HAL_Delay(10);
	}

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

	while (true)
	{
		Blink(blinkDelay);
		blinkDelay = 1000;

		now = HAL_GetMicros();
		ticks = HAL_GetTick(); //now / 1000;

		if (eepromSaveTime && (ticks >= eepromSaveTime))
		{
			CalibrateSensors();
			eepromData.Magic = VALID_EEPROM_MAGIC;
			enableEEPROMWriting();
			char *eepromBytes = (char *)&eepromData;
			int addr = 0;
			for (int i = 0; i < sizeof(eepromData); i += sizeof(uint32_t))
			{
				writeEEPROMWord(addr, *((uint32_t *)(&eepromBytes[i])));
				addr += sizeof(uint32_t);
			}
			disableEEPROMWriting();
			eepromSaveTime = 0;
		}

#if IS_CONTROLLER
		if (vibrationStopTime0 && (ticks > vibrationStopTime0))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE0_GPIO_Port, CTL_VIBRATE0_Pin, GPIO_PIN_RESET);
			vibrationStopTime0 = 0;
		}

		if (vibrationStopTime1 && (ticks > vibrationStopTime1))
		{
			HAL_GPIO_WritePin(CTL_VIBRATE1_GPIO_Port, CTL_VIBRATE1_Pin, GPIO_PIN_RESET);
			vibrationStopTime1 = 0;
		}
		ProcessADC();
#endif //IS_CONTROLLER

#if IS_HMD
		if (LastKnobChange && (ticks - LastKnobChange >= 2)) //using sw debounce 2 ms
		{			
			LastKnobChange = 0;
			uint8_t btnUp = HAL_GPIO_ReadPin(CTL_BTN1_GPIO_Port, CTL_BTN1_Pin) == GPIO_PIN_SET ? 1 : 0;
			uint8_t btnDown = HAL_GPIO_ReadPin(CTL_BTN2_GPIO_Port, CTL_BTN2_Pin) == GPIO_PIN_SET ? 1 : 0;
			if (btnUp && !btnDown)
			{
				//up
				if (KnobState < 0) KnobState = 0;
				KnobState += KnobCount / 4;				
				if (KnobState == 0) KnobState = 1;
				//KnobCache &= ~BUTTON_2;
			}
			else if (!btnUp && btnDown)
			{
				//down
				//KnobCache &= ~BUTTON_1;
				if (KnobState > 0) KnobState = 0;
				KnobState -= KnobCount / 4;
				if (KnobState == 0) KnobState = -1;
			}
			KnobCount = 0;
		}
#endif //IS_HMD


		if (LastDigitalChange && (ticks - LastDigitalChange >= 25)) //using sw debounce 25ms (appx. 40 cps)
		{
			LastDigitalChange = 0;
			DigitalValues = 0;
			if (HAL_GPIO_ReadPin(CTL_BTN0_GPIO_Port, CTL_BTN0_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_0;
#if IS_CONTROLLER
			if (HAL_GPIO_ReadPin(CTL_BTN1_GPIO_Port, CTL_BTN1_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_1;
			if (HAL_GPIO_ReadPin(CTL_BTN2_GPIO_Port, CTL_BTN2_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_2;
			if (HAL_GPIO_ReadPin(CTL_BTN3_GPIO_Port, CTL_BTN3_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_3;
			if (HAL_GPIO_ReadPin(CTL_BTN4_GPIO_Port, CTL_BTN4_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_4;
			if (HAL_GPIO_ReadPin(CTL_BTN5_GPIO_Port, CTL_BTN5_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_5;
			if (HAL_GPIO_ReadPin(CTL_BTN6_GPIO_Port, CTL_BTN6_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_6;
			if ((DigitalValues & ~BUTTON_0) == 0) //middle button only if no direction is pressed
				if (HAL_GPIO_ReadPin(CTL_BTN7_GPIO_Port, CTL_BTN7_Pin) == GPIO_PIN_SET) DigitalValues |= BUTTON_7;
#endif //IS_CONTROLLER
		}
#if IS_CONTROLLER		
		if (ticks - lastButtonRefresh >= buttonRefreshTimeout)
		{
			//update button status every 250ms.
			buttonRetransmit++;
			lastButtonRefresh = ticks;
		}
#endif //IS_CONTROLLER

		if (DigitalCache != DigitalValues)
		{
			//if any digital value has changes
			DigitalCache = DigitalValues;
			//hasTriggerData = true;
			buttonRetransmit = 1
#if IS_CONTROLLER						
				+ 4
#endif //IS_CONTROLLER
				;
			lastButtonRefresh = ticks;
		}


		ProcessSensors();

#if IS_HMD
		//process only COMMAND packets from USB		
		if (((pFromUSBPacket->Header.Type & 0xF0) == COMMAND_DATA) && (pFromUSBPacket->Command.Command != CMD_NONE))
		{
			if (CheckPacketCrc(pFromUSBPacket))
			{
				uint8_t channelIndex = pFromUSBPacket->Header.Type & 0x0F;
				if (channelIndex == THIS_DEVICE)
				{
					ProcessOwnPacket(pFromUSBPacket);
				}
				else if (channelIndex < MAX_SOURCE)
				{
					//forward from USB to RF
					CommChannel *pChannel = &Channels[channelIndex];
					//only send if active more than 1 sec
					if ((pChannel->lastOutSequence != pFromUSBPacket->Header.Sequence) && ((ticks - pChannel->lastReceive) <= 1000))
					{
						//got packet from usb, forward to trackeddevice
						memcpy(&pChannel->lastCommand, pFromUSBPacket, sizeof(USBPacket));
						//send same packet a few times
						pChannel->remainingTransmits = 5;
						pChannel->nextTransmit = ticks;
						pChannel->lastOutSequence = pFromUSBPacket->Header.Sequence;
						ChannelStateFlags |= 1 << channelIndex;
					}
					memset(pFromUSBPacket, 0, sizeof(USBPacket)); //clear incoming
				}
			}
		}
#endif //IS_HMD

		rfStatus = RF_Status(&hspi2);
		readyToReceive = (rfStatus & RF_RX_DR_IRQ_CLEAR) == RF_RX_DR_IRQ_CLEAR ? 1 : 0;

		if (readyToReceive)
		{
			rfStatus = RF_FifoStatus(&hspi2);
			readyToReceive = (rfStatus & RF_RX_FIFO_EMPTY_Bit) == 0x00 ? 1 : 0;
			rcvCounter = 0;
			while ((rcvCounter < 3) && readyToReceive) //max 3 packets 
			//if (readyToReceive) //one rf packet at a time
			{
				rcvCounter++;
				//receive command
				//has fifo, receive
				readyToReceive = RF_ReceivePayload(&hspi2, (uint8_t*)&FromRFPacket, sizeof(USBPacket)) == 0 ? 1 : 0; //if not empty 
				if (CheckPacketCrc(&FromRFPacket))
				{
					if (((FromRFPacket.Header.Type & 0x0F)) == THIS_DEVICE)
					{
						ProcessOwnPacket(&FromRFPacket);
					}
#if IS_HMD
					else
					{
						//forward from RF to USB
						while (HAL_GetTick() - LastUsbTransmit <= extraDelay) {};
						ForwardPacket(&FromRFPacket);
					}
#endif //IS_HMD	
				}
			}
		}

