sencercoltu/openvr-customhmd/stm32/TrackedDevice/Src/main.c
#if IS_HMD		
		BroadcastRFPackets();
#endif //IS_HMD	


		if (!ProcessMask)
		{
			if (buttonRetransmit)
				ReadyMask |= READY_BUT;
			if (feedRawMode)
				ReadyMask |= READY_RAW;
			if (SensorCalibRequest != 0xFF)
				ReadyMask |= READY_CAL;
			if (KnobState)
				ReadyMask |= READY_IPD;
			if (ReadyMask)
			{
				ProcessMask = ReadyMask;
				ReadyMask = 0;
			}
		}
		ticks = HAL_GetTick();
		if (ProcessMask && (ticks >= nextSend))
		{
#if IS_CONTROLLER
			rfStatus = RF_FifoStatus(&hspi2);
			readyToSend = (rfStatus & RF_TX_FIFO_FULL_Bit) == 0x00 ? 1 : 0;
#endif //IS_CONTROLLER			
#if IS_HMD
			while (HAL_GetTick() - LastUsbTransmit <= extraDelay) {};
			readyToSend = 1;
#endif //IS_HMD
		}

		if (readyToSend)
		{
#if IS_CONTROLLER			
			RF_TransmitMode(&hspi2, RF_InitStruct.RF_TX_Adress); //switch to tx mode
#endif //IS_CONTROLLER			
			//HAL_MicroDelay(10);			
			blinkDelay = 100;

			sndCounter++;

			if (ProcessMask & READY_CAL)
			{
				FromDevicePacket.Header.Type = THIS_DEVICE | COMMAND_DATA;
				FromDevicePacket.Header.Sequence++;
				FromDevicePacket.Command.Command = CMD_CALIBRATE;
				if (SensorCalibRequest == SENSOR_ACCEL)
					FromDevicePacket.Command.Data.Calibration = eepromData.Accel;
				else if (SensorCalibRequest == SENSOR_GYRO)
					FromDevicePacket.Command.Data.Calibration = eepromData.Gyro;
				else if (SensorCalibRequest == SENSOR_MAG)
					FromDevicePacket.Command.Data.Calibration = eepromData.Mag;
				FromDevicePacket.Command.Data.Calibration.Command = CALIB_GET;
				FromDevicePacket.Command.Data.Calibration.Sensor = SensorCalibRequest;
				SensorCalibRequest = 0xFF;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_CAL;
			}
			else if (ProcessMask & READY_RAW)
			{
				FromDevicePacket.Header.Type = THIS_DEVICE | COMMAND_DATA;
				FromDevicePacket.Header.Sequence++;
				FromDevicePacket.Command.Command = CMD_RAW_DATA;
				FromDevicePacket.Command.Data.Raw.State = feedRawMode;
				for (int idx = 0; idx < 3; idx++)
				{
					switch (feedRawMode)
					{
					case RawMode_Off:
						break;
					case RawMode_Raw:
					{
						//raw sensor values
						FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Raw[idx];
						FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Raw[idx];
						FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Raw[idx];
						break;
					}
					case RawMode_Filtered:
					{
						//filtered sensor data
						FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Filtered[idx];
						FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Filtered[idx];
						FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Filtered[idx];
						break;
					}
					case RawMode_Compensated:
					{
						//compensated sensor data
						FromDevicePacket.Command.Data.Raw.Accel[idx] = tSensorData.Accel.Compensated[idx];
						FromDevicePacket.Command.Data.Raw.Gyro[idx] = tSensorData.Gyro.Compensated[idx];
						FromDevicePacket.Command.Data.Raw.Mag[idx] = tSensorData.Mag.Compensated[idx];
						break;
					}
					case RawMode_DRVectors:
					{
						//deadreckoning vectors
						FromDevicePacket.Command.Data.Raw.Accel[idx] = (int16_t)(GravityVector[idx] / aRes);
						FromDevicePacket.Command.Data.Raw.Gyro[idx] = (int16_t)(CompAccelVector[idx] / aRes); //in m/s2
						FromDevicePacket.Command.Data.Raw.Mag[idx] = VelocityVector[idx] * 1000; //in mm/s
						break;
					}
					}
				}
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_RAW;
			}
			else if (ProcessMask & READY_POS)
			{
				hasPositionData = false;
				FromDevicePacket.Header.Type = THIS_DEVICE | POSITION_DATA;
				FromDevicePacket.Header.Sequence++;

				//remap
				FromDevicePacket.Position.Position[0] = positionQuat.x; //position.Position[0];
				FromDevicePacket.Position.Position[1] = positionQuat.z; //position.Position[2];
				FromDevicePacket.Position.Position[2] = -positionQuat.y; //-position.Position[1];
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_POS;
			}
			else if (ProcessMask & READY_ROT)
			{
				//send rot data
				hasRotationData = false;
				FromDevicePacket.Header.Type = THIS_DEVICE | ROTATION_DATA;
				FromDevicePacket.Header.Sequence++;
				//remap				
				FromDevicePacket.Rotation.w = orientQuat.w;
				FromDevicePacket.Rotation.x = orientQuat.x;
				FromDevicePacket.Rotation.y = orientQuat.z;
				FromDevicePacket.Rotation.z = -orientQuat.y;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_ROT;
			}
			else if (ProcessMask & READY_BUT)
			{
				buttonRetransmit--;
				FromDevicePacket.Header.Type = THIS_DEVICE | TRIGGER_DATA;
				FromDevicePacket.Header.Sequence++;
#if IS_HMD					
				FromDevicePacket.Trigger.Analog[0].x = 0;
				FromDevicePacket.Trigger.Analog[0].y = 0;
				FromDevicePacket.Trigger.Analog[1].x = 0; //reserved
				FromDevicePacket.Trigger.Analog[1].y = 0; //reserved
#endif //IS_HMD					

#if IS_CONTROLLER					
				FromDevicePacket.Trigger.Analog[0].x = ((float)ADC_Cache[1]) / 100.0f; //trigger
				FromDevicePacket.Trigger.Analog[0].y = ((float)ADC_Cache[0]) / 100.0f; //Extra
				FromDevicePacket.Trigger.Analog[1].x = 0; //reserved
				FromDevicePacket.Trigger.Analog[1].y = 0; //reserved
#endif //IS_CONTROLLER

				FromDevicePacket.Trigger.Digital = DigitalCache;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_BUT;
			}
			else if (ProcessMask & READY_IPD)
			{				
				FromDevicePacket.Header.Type = THIS_DEVICE | COMMAND_DATA;
				FromDevicePacket.Command.Command = CMD_IPD;
				FromDevicePacket.Header.Sequence++;				
				FromDevicePacket.Command.Data.IPD.Direction = KnobState;
				KnobState = 0;
				SetPacketCrc(&FromDevicePacket);
				ForwardPacket(&FromDevicePacket);
				ProcessMask &= ~READY_IPD;
			}



			if (!ProcessMask)
#if IS_CONTROLLER			
				nextSend = ticks + (extraDelay + (rand() % 10)); //for next RF packet
			do { rfStatus = RF_FifoStatus(&hspi2); } while ((rfStatus & RF_TX_FIFO_EMPTY_Bit) != RF_TX_FIFO_EMPTY_Bit); //wait for send complete			
#endif //IS_CONTROLLER			
#if IS_HMD
			nextSend = ticks + extraDelay; //for next USB packet
#endif //IS_HMD

			readyToSend = 0;
#if IS_CONTROLLER
			HAL_MicroDelay(10);
			RF_ReceiveMode(&hspi2, RF_InitStruct.RF_RX_Adress_Pipe0); //back to rx mode
#endif //IS_CONTROLLER			
		}
	}
  /* USER CODE END WHILE */

